package com.wsy.leetcode.linknode.AL_445_addTwoNumbers;

public class AL_445 {

    /**
     * 445. 两数相加 II
     * 给你两个 非空 链表 来代表两个非负整数。
     * 数字最高位 位于链表开始位置。
     * 它们的每个节点 只存储一位数字。将这两数相加 会返回一个新的链表。
     * <p>
     * 你可以假设除了数字 0 之外，这两个数字都不会以零开头。
     * <p>
     * <p>
     * <p>
     * 进阶：
     * <p>
     * 如果输入链表不能修改该如何处理？换句话说，你不能对列表中的节点进行翻转。
     * <p>
     * <p>
     * <p>
     * 示例：
     * <p>
     * 输入：(7 -> 2 -> 4 -> 3) + (5 -> 6 -> 4)
     * 输出：7 -> 8 -> 0 -> 7
     * <p>
     * ---》
     * todo 而 第2题 是 逆序好 的情况，直接 相加 即可
     */
    public static void main(String[] args) {


    }
}
